#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.os_password: Refreshing state... [id=none]
random_string.random: Refreshing state... [id=nqP0]
random_password.db_password: Refreshing state... [id=none]
data.aws_route53_zone.opensearch: Reading...
data.aws_acm_certificate.non_prod_domain: Reading...
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:cluster/dms-cluster-prod]
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Reading...
aws_kms_key.log_group_key: Refreshing state... [id=6edc89d8-628c-4482-bc47-44620ca85570]
aws_secretsmanager_secret.opensearch_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:opensearch-creds-prod-P5Z2Vt]
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Reading...
aws_secretsmanager_secret.harbor_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:harbor-credentials-prod-EGtEWi]
aws_secretsmanager_secret.backend_secret_key: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:backend-secret-key-prod-cGhlzg]
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.get_secrets_policy: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-0d4f57bfbb21785c0]
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Read complete after 0s [id=2597252832]
data.aws_iam_policy_document.get_secrets_policy: Read complete after 0s [id=258835557]
data.aws_acm_certificate.opensearch: Reading...
data.aws_iam_policy_document.ecs_task_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_role_policy: Read complete after 0s [id=3789633034]
aws_secretsmanager_secret.azure_app_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-credentials-prod-4vsNzP]
data.aws_route53_zone.opensearch: Read complete after 1s [id=Z0724547YPY8RPPKBNKT]
aws_secretsmanager_secret.postgresql_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:dms-postgresql-credentials-prod-hIAcQi]
data.aws_caller_identity.current_account: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-task-execution-role-prod]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role-prod]
aws_cloudwatch_log_resource_policy.elasticsearch-log-publishing-policy: Refreshing state... [id=elasticsearch-log-publishing-policy]
aws_secretsmanager_secret_version.azure_app_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-credentials-prod-4vsNzP|BAC0CBF2-1CBD-42B6-9387-BEA116736496]
data.aws_caller_identity.current_account: Read complete after 0s [id=654654181948]
aws_secretsmanager_secret_version.opensearch_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:opensearch-creds-prod-P5Z2Vt|2C81DB59-2030-413B-AA87-358905C10906]
aws_secretsmanager_secret_version.harbor_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:harbor-credentials-prod-EGtEWi|91706CD0-BFAF-4D9B-9DCF-897ECA74DA39]
aws_secretsmanager_secret_version.backend_secret_key: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:backend-secret-key-prod-cGhlzg|866C3A3A-BE58-418B-BA0C-1F476CA5A145]
aws_ecs_cluster_capacity_providers.cluster: Refreshing state... [id=dms-cluster-prod]
aws_cloudwatch_log_group.opensearch_log_group_search_slow_logs: Refreshing state... [id=/aws/es/prod20250320091807586900000001]
aws_cloudwatch_log_group.opensearch_log_group_es_application_logs: Refreshing state... [id=/aws/es/prod20250320091143080500000007]
aws_kms_key_policy.log_group_key_policy: Refreshing state... [id=6edc89d8-628c-4482-bc47-44620ca85570]
aws_cloudwatch_log_group.opensearch_log_group_index_slow_logs: Refreshing state... [id=/aws/es/prod20250320091143080300000006]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/aws/vendedlogs/states/ecs-prod-20250320091143080000000005]
data.aws_acm_certificate.opensearch: Read complete after 1s [id=arn:aws:acm:eu-west-1:654654181948:certificate/bc14494c-2be8-47c8-9ab4-e95e40b3d41f]
aws_iam_role_policy_attachment.task_s3_access: Refreshing state... [id=ecs-task-role-prod-20250320091139682000000002]
data.aws_acm_certificate.non_prod_domain: Read complete after 1s [id=arn:aws:acm:eu-west-1:654654181948:certificate/eee68a4b-e83d-4660-98b5-33cb3fa95389]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=ecs-task-role-prod:terraform-20250320091139444100000001]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-task-execution-role-prod-20250320091139777400000003]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecs-task-execution-role-prod:dms-ecs-task-secretsmanager-prod]
data.aws_iam_policy_document.write_logs: Reading...
aws_ecs_task_definition.frontend: Refreshing state... [id=dms-frontend-prod]
data.aws_iam_policy_document.write_logs: Read complete after 0s [id=1935436996]
aws_iam_role_policy.write_logs: Refreshing state... [id=ecs-task-execution-role-prod:dms-ecs-task-write-logs-prod]
aws_subnet.az1c: Refreshing state... [id=subnet-03d764259a1e5d8ce]
aws_security_group.default: Refreshing state... [id=sg-05eb414bbdefe0967]
aws_lb_target_group.ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:targetgroup/ecs-target-group-prod/e4b86f9a9b909cb3]
aws_internet_gateway.vpc: Refreshing state... [id=igw-05626d19c936d2543]
aws_security_group.task: Refreshing state... [id=sg-0d4071033298ff41e]
aws_subnet.az1a: Refreshing state... [id=subnet-0d12c1ac834229aa9]
aws_security_group.dms-ecs: Refreshing state... [id=sg-0e6d1beb9658a975d]
aws_subnet.az1b: Refreshing state... [id=subnet-0dea63c1698c891c3]
aws_security_group.backend-ecs: Refreshing state... [id=sg-08e207c12c5ec9ec2]
aws_lb_target_group.ecs_bg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:targetgroup/ecs-target-group-backend-prod/979bed253df30b4f]
aws_security_group.frontend-alb: Refreshing state... [id=sg-0795dc9210e1fe331]
aws_security_group.opensearch_sg: Refreshing state... [id=sg-0290b2cca85325e5a]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4_task: Refreshing state... [id=sgr-0b622013920e7625e]
aws_route.igw: Refreshing state... [id=r-rtb-0c05b84bb70ef2dfd1080289494]
aws_security_group.dms-db: Refreshing state... [id=sg-007dea6012eb8a21e]
aws_security_group.backend-alb: Refreshing state... [id=sg-0fb22bef8caccc7de]
aws_db_subnet_group.dms: Refreshing state... [id=postgres-dms-sn-group-prod]
aws_security_group.frontend-ecs: Refreshing state... [id=sg-0d8a4b810efc63e2e]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:loadbalancer/app/ecs-alb-prod/2f3893894bfe55ea]
aws_vpc_security_group_ingress_rule.opensearch_sg_ingress: Refreshing state... [id=sgr-055b8ebadea006b39]
aws_opensearch_domain.opensearch: Refreshing state... [id=arn:aws:es:eu-west-1:654654181948:domain/dms-engine-prod]
aws_ecs_service.frontend_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-prod/frontend-service]
aws_route53_record.frontend: Refreshing state... [id=Z0724547YPY8RPPKBNKT_deltares-fairdata.com_A]
aws_lb_listener.ecs_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:listener/app/ecs-alb-prod/2f3893894bfe55ea/9e2c2207dd12e799]
aws_db_instance.dms: Refreshing state... [id=db-N2O6MOMQ5VZ6FS4YGAMIV4XQ7A]
aws_secretsmanager_secret_version.postgresql_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:dms-postgresql-credentials-prod-hIAcQi|44438FC6-7C75-4F9B-AC79-9B1A0E5828EB]
aws_lb_listener_rule.backend_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:listener-rule/app/ecs-alb-prod/2f3893894bfe55ea/9e2c2207dd12e799/d2228815f04d818d]
aws_ecs_task_definition.backend: Refreshing state... [id=dms-backend-prod]
aws_ecs_service.backend_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-prod/backend-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.backend_service will be updated in-place
  ~ resource "aws_ecs_service" "backend_service" {
        id                                 = "arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-prod/backend-service"
        name                               = "backend-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:654654181948:task-definition/dms-backend-prod:4" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.frontend_service will be updated in-place
  ~ resource "aws_ecs_service" "frontend_service" {
        id                                 = "arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-prod/frontend-service"
        name                               = "frontend-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:654654181948:task-definition/dms-frontend-prod:3" -> "arn:aws:ecs:eu-west-1:654654181948:task-definition/dms-frontend-prod:2"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.backend must be replaced
-/+ resource "aws_ecs_task_definition" "backend" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:654654181948:task-definition/dms-backend-prod:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:654654181948:task-definition/dms-backend-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "dms-backend-prod" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @RobertBroersma, Action: `pull_request`, Working Directory: `./infra`, Workflow: `Terraform Infrastructure Change Management Pipeline with GitHub Actions`*